maze = [
    [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
    [9, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 9],
    [9, 0, 9, 0, 0, 0, 9, 9, 0, 9, 9, 9],
    [9, 0, 9, 9, 0, 9, 0, 0, 0, 9, 0, 9],
    [9, 0, 0, 0, 9, 0, 0, 9, 9, 0, 9, 9],
    [9, 9, 9, 0, 0, 9, 0, 9, 0, 0, 0, 9],
    [9, 0, 0, 0, 9, 0, 9, 0, 0, 9, 1, 9],
    [9, 0, 9, 0, 0, 0, 0, 9, 0, 0, 9, 9],
    [9, 0, 0, 9, 0, 9, 0, 0, 9, 0, 0, 9],
    [9, 0, 9, 0, 9, 0, 9, 0, 0, 9, 0, 9],
    [9, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 9],
    [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]
]

dir = [[1, 0], [0, 1], [-1, 0], [0, -1]]

x, y, depth, d = 1, 1, 0, 0

while maze[x][y] != 1:
    maze[x][y] = 2
    print("-------------------------------")
    print("(" + str(x) + "," + str(y) + ")")
    if d == 0:
        print("下向いてるよ")
    elif d == 1:
        print("右向いてるよ")
    elif d == 2:
        print("上向いてるよ")
    else:
        print("左向いてるよ")

    for i in range(len(dir)):
        # 向いてる方向によって、最初に調べる絶対方向が変わるからここで計算している
        # eg.) 下を向いてる時は、右は絶対方向では左
        # 下(d=0)を向いている時の調べる順番: 左、下、右、上 => 3,0,1,2
        # 右(d=1)を向いている時の調べる順番: 下、右、上、左 => 0,1,2,3
        # 上(d=2)を向いている時の調べる順番: 右、上、左、下 => 1,2,3,0
        # 左(d=3)を向いている時の調べる順番: 上、左、下、右 => 2,3,0,1
        j = (d + i - 1) % len(dir)  # -1%4=3, 0%4=0,3%4=3, 2%4=2
        # j = (0 + i - 1) % len(dir)
        # j = (0 + 3) % 4 = 3
        # j =
        print("探索" + str(i) + "週目")
        print(d + i - 1)
        print(j)
        if j == 0:
            print("下を調査")
        elif j == 1:
            print("右を調査")
        elif j == 2:
            print("上を調査")
        else:
            print("左を調査")
        if maze[x + dir[j][0]][y + dir[j][1]] < 2:
            x += dir[j][0]
            y += dir[j][1]
            d = j
            depth += 1
            break
        elif maze[x + dir[j][0]][y + dir[j][1]] == 2:
            x += dir[j][0]
            y += dir[j][1]
            d = j
            depth -= 1
            break

print(depth)
